Tekla Open API Reference for Tekla Structures 2025
IUIEvents Interface
 Interface for the Events class allows the user to register event listeners for DrawingUI events. This interface allows the Marshaling of the Events class with Trimble.Remoting
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IUIEvents
Public Interface IUIEvents
The IUIEvents type exposes the following members.
Methods
Name | Description
OnInterrupted
 Called when uesr interrupts.
Register
 Registers the instance to listen to the specified events.
UnRegister
 Unregisters the instance from listening to events.
Top
Events
Name | Description
DocumentManagerClosed
 The DocumentManagerClosed eventis raised when the document manager is closed.
DrawingEditorClosed
 The DrawingEditorClosed event is raised when the drawing editor is closed.
DrawingEditorOpened
 The DrawingEditorOpened event is raised when the drawing editor is opened.
DrawingListSelectionChanged
 The DrawingListSelectionChanged event is raised when selection on the drawing list has changed.
DrawingLoaded
 The DrawingLoaded event is raised when a new drawing is opened in the drawing editor.
Interrupted
 Occurs when user interrupts.
SelectionChange
 The SelectionChange event is raised when the selection is changed in a Tekla Structures drawing.
Top
See Also
Reference
Tekla.Structures.Drawing.UI Namespace